import { Component } from '@angular/core';

@Component({
  selector: 'app-order',
  templateUrl: './order.component.html',
  styleUrls: ['./order.component.css'],
})
export class OrderComponent {
  constructor() {}

  selected: string | null = null; // Свойство для двусторонней привязки
  select: string | null = null;

  // Массив с ложными данными
  listings = [
    {
      id:1,
      title: '2 комнаты, 61.8 м²',
      address:
        'Новостройка, ЖК «Шестое чувство», ул. Композитора Ставонина, 55/9к2',
      kitchen: 'Кухня: . . . . . . . . . . . . . . . . 13.8 м²',
      floor: 'Этаж: . . . . . . . . . . . . . . . . 6',
      deadline: 'Срок сдачи: . . . . . . . . . . сдан',
      price: 'Не указана',
      img: '../../../../assets/img/house.png', // Заглушка для изображения
    },
    {id:2,
      title: '2 комнаты, 61.8 м²',
      address:
        'Новостройка, ЖК «Шестое чувство», ул. Композитора Ставонина, 55/9к2',
      kitchen: 'Кухня: . . . . . . . . . . . . . . . . 13.5 м²',
      floor: 'Этаж: . . . . . . . . . . . . . . . . 11',
      deadline: 'Срок сдачи: . . . . . . . . . . сдан',
      price: 'Не указана',
      img: '../../../../assets/img/house.png',
    },
    {id:3,
      title: '2 комнаты, 61.8 м²',
      address:
        'Новостройка, ЖК «Шестое чувство», ул. Композитора Ставонина, 55/9к2',
      kitchen: 'Кухня: . . . . . . . . . . . . . . . . 13.1 м²',
      floor: 'Этаж: . . . . . . . . . . . . . . . . 4',
      deadline: 'Срок сдачи: . . . . . . . . . . сдан ',
      price: 'Не указана',
      img: '../../../../assets/img/house.png',
    },
    {id:4,
      title: '3 комнаты, 90.5 м²',
      address:
        'Новостройка, ЖК «Шестое чувство», ул. Композитора Ставонина, 55/9к2',
      kitchen: 'Кухня: . . . . . . . . . . . . . . . . 15.7 м²',
      floor: 'Этаж: . . . . . . . . . . . . . . . . 5',
      deadline: 'Срок сдачи: . . . . . . . . . . сдан',
      price: 'Не указана',
      img: '../../../../assets/img/house.png',
    },
    {id:5,
      title: '3 комнаты, 92.4 м²',
      address: 'Новостройка, ЖД «Грани» г. Воронеж, ул. Победы, 18А',
      kitchen: 'Кухня: . . . . . . . . . . . . . . . . 23.3 м²',
      floor: 'Этаж: . . . . . . . . . . . . . . . . 10',
      deadline: 'Срок сдачи: . . . . . . . . . . сдан',
      price: 'Не указана',
      img: '../../../../assets/img/house.png',
    },
  ];
}
